app/views/static_pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <li>
                <%=gravatar_for(@users.find(post.user_id), 50)%>

SELECT  "microposts".* FROM "microposts" ORDER BY views DESC, "microposts"."views" DESC LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
---
        <ul class="posts">
            <% Micropost.all.order(views: :desc).limit(6).each do |post|%>