app/views/comments/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<li>
    <%= comment.body %> - <%= User.find_by_id(comment.user_id).name%>