app/views/microposts/show.html.erb

    </div>
    <% if current_user == User.find_by_id(@post.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]