app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Hi There"], ["commentable_id", 1], ["commentable_type", "Micropost"], ["user_id", 1], ["created_at", "2020-05-17 14:53:28.492526"], ["updated_at", "2020-05-17 14:53:28.492526"]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "microposts" SET "comment_count" = $1, "updated_at" = $2 WHERE "microposts"."id" = $3  [["comment_count", 1], ["updated_at", "2020-05-17 15:30:15.411741"], ["id", 40]]
---
  def create
    find_commentable
    @comment = @commentable.comments.new comment_params

    if @comment.save
      redirect_back fallback_location: root_path
      count = Micropost.find_by_id(params[:comment][:micropost_id]).comment_count
      Micropost.find_by_id(params[:comment][:micropost_id]).update(comment_count: count + 1)