app/controllers/microposts_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "microposts" SET "views" = $1, "updated_at" = $2 WHERE "microposts"."id" = $3  [["views", 1], ["updated_at", "2020-05-15 07:46:14.384338"], ["id", 1]]
---
  def show
    @post = Micropost.find(params[:id])
    @post.update(views: @post.views + 1)