app/controllers/static_pages_controller.rb

  def home
    @users = User.order(created_at: :asc).last(6)
---
SELECT  "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1  [["LIMIT", 6]]