app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."topic" = $1 ORDER BY comment_count DESC LIMIT $2 OFFSET $3  [["topic", "News"], ["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."topic" = $1  [["topic", "News"]]
SELECT  "microposts".* FROM "microposts" ORDER BY "microposts"."created_at" DESC, views DESC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts"
---
  def home
    @users = User.all
    @topics = topics

    if (params[:sort].present?)
      order = params[:sort]
    else
      order = "created_at"
    end

    if params[:topic].present?
      @posts = Micropost.where(topic: params[:topic]).order(order + " DESC").paginate(page: params[:page], per_page: 20)
    else
      @posts = Micropost.order(order + " DESC").paginate(page: params[:page], per_page: 20)